start_text = """
🚀 Вы готовы к революции в обслуживании клиентов? 🚀
"""

start_info_text = """

💥 Добро пожаловать! Меня зовут Лев, и я здесь, чтобы автоматизировать и упростить ваш бизнес с помощью инновационных чат-ботов в Telegram!

ℹ️ Для получения необходимой информации и удобного взаимодействия с ботом используйте следующие команды:

💁 ИНФОРМАЦИЯ
/portfolio - Мои работы
/service - Мои услуги
/about - Информация обо мне
/price - Стоимость услуг

🔥 ВЗАИМОДЕЙСТВИЕ
/start - Запустить бота
/request - Заказать бота
/feedback - Оставить отзыв
"""

service_text = """

🔍 <i>Мои услуги включают:</i>

- Разработку персонализированных чат-ботов под ключ.
- Разработка чат-ботов на основе искусственного интеллекта.
- Создание административной панели внутри бота.
- Подключение базы данных и аналитики.
- Поддержку и обновление функционала чат-ботов.

🎯 <i>Для кого мои услуги?</i>

Мои услуги идеально подходят для всех, кто желает улучшить свой сервис, автоматизировать коммуникации и бизнес-процессы через один из самых популярных мессенджеров в мире.

💥 <i>Готовы ли вы к изменениям?</i> 💥

Если вы ищете надежного партнера для создания чат-бота, который станет вашим незаменимым помощником в автоматизации бизнес-процессов, то свяжитесь со мной сегодня!

Мой телеграм аккаунт - @bratisman

Вместе мы сможем создать что-то по-настоящему уникальное для вашего бизнеса!
"""


telegram_text = """

- <b>МГНОВЕННОЕ ОБЩЕНИЕ</b>
Ваши клиенты получают ответы на свои вопросы 24/7 без задержек.

- <b>ВЫСОКАЯ ВОВЛЕЧЕННОСТЬ</b>
Telegram - одно из самых популярных мессенджеров с миллионной аудиторией, готовой взаимодействовать с вашим брендом.

- <b>ГИБКОСТЬ И МАСШТАБИРУЕМОСТЬ</b>
Чат-боты легко адаптируются под любые задачи и потребности вашего бизнеса.

- <b>АВТОМАТИЗАЦИЯ</b>
От заказа товаров до записи на услуги - все процессы могут быть автоматизированы, снижая нагрузку на персонал.
"""


tools_text = """

🐍 Я предлагаю передовые, масштабируемые и настраиваемые чат-боты, используя <b>Python</b> и <b>Aiogram</b> для разработки. Это сочетание обеспечивает мощность, гибкость и эффективность, позволяя создавать сложные решения

💾 Для хранения данных применяю <b>SQLite</b> и <b>PostgreSQL</b>, выбирая оптимальный вариант в зависимости от размера проекта.

🌐 Для развертывания и непрерывной работы моих чат-ботов я использую <b>VPS</b> (Виртуальный Частный Сервер), что гарантирует высокую скорость работы, стабильность и доступность бота 24/7 для пользователей со всего мира.

🔧 Разработка административной панели внутри бота и интеграция аналитических инструментов позволяют мне предоставлять заказчикам полный контроль над функционированием бота, а также доступ к детальной статистике и аналитике использования.

⚠️ В 90% случаев я отказываюсь от использования готовых конструкторов чат-ботов, так как они ограничивают возможности кастомизации и не предоставляют полного контроля над проектом.
"""


portfolio_text = """
Я работал над многими проектами, включая:

- Интернет-магазин
- AI ассистент
- Конвертер валют
- И не только

⬇️Выбирайте и смотрите!⬇️
"""

roma_pizza_text = """
ℹ️ Бот был спроектирован для автоматизации процесса заказа пиццы через Телеграм
# Использование многоуровневого inline-меню облегчает процесс взаимодействия с ботом

⚙️ ОСНОВНОЙ ФУНКЦИОНАЛ:
- Предоставление информации о ресторане
- Выбор категории/блюда
- Занесение выбранных блюд в корзину
- Оформление заказа
- Подтверждение заказа
- Занесение информации о заказе в базу данных

🔧 ДОПОЛНИТЕЛЬНЫЕ ФУНКЦИОНАЛ И ТЕХНОЛОГИИ:
- Админ-панель для добавления/изменения/удаления ассортимента
- Пагинация в меню (Перелистывание товаров по страницам)
- База данных с информацией о заказах и о пользователях

🤖 @romapizzadel_bot
"""

converter_text = """
ℹ️ Бот был спроектирован для конвертации самых популярных валют, используя актуальные данные ЦБ РФ

⚙️ ОСНОВНОЙ ФУНКЦИОНАЛ:
- Вывод текущего курса всех валют(в рублях)
- Выбор пары валют для конвертации
- Выбор количества валюты для конвертации
- Вывод результата конвертации

🤖 @vaconverta_bot
"""

papion_text = """
ℹ️ Бот был спроектирован на основе генеративного ИИ (GPT) для подбора и генерации рецептов

⚙️ ОСНОВНОЙ ФУНКЦИОНАЛ:
- Предоставление информации/инструкции по применению
- Нахождение рецепта по названию блюда
- Подбор рецепта по вкусовым предпочтениям пользователя
- Подбор рецепта по ингредиентам
- В случае проблем с генерацией предусмотрен рецепт по-умолчанию

🔧 ДОПОЛНИТЕЛЬНЫЕ ФУНКЦИОНАЛ И ТЕХНОЛОГИИ:
- Админ-панель для рассылки и вывода статистики
- Отправка отзывов о работе бота
- База данных с информацией о пользователях

🤖 @papionaicook_bot
"""

clothy_text = """
ℹ️ Прототип интернет-магазина

⚙️ ОСНОВНОЙ ФУНКЦИОНАЛ:
- Фильтрация товара по категориям и подкатегориям
- Добавление товара в корзину
- Просмотр и изменение корзины
- Оформление заказа
- Подтверждение заказа
- Проведение оплаты
- Занесение информации о заказе в базу данных

🔧 ДОПОЛНИТЕЛЬНЫЕ ФУНКЦИОНАЛ И ТЕХНОЛОГИИ:
- Админ-панель для добавления/изменения/удаления товаров
- Рассылка сообщений всем пользователям, вывод статистики о заказах
- База данных с информацией о заказах, пользователях, товарах

🤖 @clothyshop_bot
"""

simple_ph_text = """
ℹ️ Бот был спроектирован для хранения и предоставления информационных материалов по физике

⚙️ ОСНОВНОЙ ФУНКЦИОНАЛ:
- Предоставление инормации о боте
- Выбор категории (Конспекты, Комиксы...)
- Получение информации о материале в виде документа
- Занесение информации о пользователях в базу данных

🔧 ДОПОЛНИТЕЛЬНЫЕ ФУНКЦИОНАЛ И ТЕХНОЛОГИИ:
- Админ-панель для добавления/изменения/удаления материалов
- Рассылка сообщений всем пользователям, вывод общей статистики
- База данных с информацией о материалах, пользователях

🤖 @simplephysicsbot
"""


about_text = """
👨‍💻 Меня зовут Лев, и мне 21 год.

Уже более четырех лет я с головой погружен в мир программирования. Мой путь начался с разработки сайтов и веб-приложений на JavaScript, а также с создания игр на Unity с использованием C#.

Около года назад я открыл для себя Python и с тех пор активно поглощаю знания и применяю их в своих проектах, не переставая удивляться гибкости и мощи этого языка.

Примерно полгода назад мой интерес к мессенджерам и чат-ботам привел меня к осознанию того, что это именно та сфера, в которой я хочу достичь настоящего мастерства и стать признанным экспертом.

Объединив страсть к программированию и увлечение мессенджерами, я начал разработку своих первых чат-ботов, видя в этом не только вызов, но и огромный потенциал для роста.
"""


feedback_text = """
Всегда рады вашим отзывам и предложениям!
"""


price_text = """
💎 Ценовая политика моих услуг по разработке чат-ботов основывается на принципах качества и индивидуального подхода.

🙌 Я не берусь за проекты, превышающие мои компетенции, чтобы гарантировать высокое качество конечного продукта. 

💵 <b>Стоимость разработки начинается от 2999 рублей</b> за чат-бот с простым функционалом (не включая аналитику), плюс настройка сервера и выгрузка на него бота (аренда и оплата сервера на стороне заказчика).

💁‍♂️ Работа начинается с предоплаты в размере 50%, которая возвращается, если я по каким-то причинам не смогу выполнить задачу.

🤝 Цена обговаривается лично, учитывая все пожелания и требования к проекту.
"""
